app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "..."], ["body", "..."], ["created_at", "2021-10-01 19:40:33.744015"], ["updated_at", "2021-10-01 19:40:33.744015"]]
---
  def create
    @article = Article.new(title: "...", body: "...")

    if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "body" = ?, "updated_at" = ?, "status" = ? WHERE "articles"."id" = ?  [["body", "Iam on Rails!"], ["updated_at", "2021-10-01 23:30:07.878786"], ["status", "public"], ["id", 1]]
---
  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)