app/controllers/comments_controller.rb

  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(comment_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?, ?)  [["commenter", "a"], ["body", "2"], ["article_id", 1], ["created_at", "2021-10-01 23:28:34.948288"], ["updated_at", "2021-10-01 23:28:34.948288"], ["status", "public"]]